# utils/messages.py

class Messages:
    # Ошибки
    transaction_service_not_init = "❌ **Ошибка!** TransactionService не инициализирован."
    transaction_save_error = "❌ **Ошибка при сохранении транзакции:** {error}"
    unexpected_error = "❌ **Критическая ошибка:** {error}"
    error_parsing = "❌ **Ошибка разбора:** {error}\n\nВведите в формате: 'кофе 300' или 'доход 500 подарок'"
    error_parsing_no_amount = "❌ **Ошибка разбора:** Не удалось распознать сумму в тексте\nВведите в формате: 'кофе 300' или 'доход 500 подарок'"
    transaction_cancelled = "❌ **Ввод транзакции отменен.**"
    
    # Успех
    transaction_saved = "✅ **Транзакция сохранена!**\n\nСумма: **{amount}** руб.\nКатегория: **{category}**\nКомментарий: *{comment}*"
    draft_saved = "✅ **Черновик сохранен!**"
    
    # Common
    test_transaction_start = "⏳ **Записываю тестовую транзакцию...** Ожидайте."
    test_transaction_success = "✅ **Тестовая транзакция успешна!**\n\nПроверьте Google Sheets."
    
    # Receipts
    photo_received = "📸 **Фото получено!** Обрабатываю..."
    receipt_processing = "🧾 **Распознаю чек...** Это может занять несколько секунд."
    receipt_recognized = "✅ **Чек распознан!**\n\nМагазин: **{retailer}**\nСумма: **{amount}** руб.\nДата: {date}"
    receipt_parse_error = "❌ **Не удалось распознать чек.** Попробуйте ввести вручную."
    receipt_processing_failed = "Анализ чека не удался."
    error_getting_file = "❌ **Ошибка!** Не удалось получить файл."
    error_file_too_big = "❌ Размер изображения слишком большой. Пожалуйста, отправьте фото меньше 5 МБ."
    receipt_sending_to_api = "⏳ **Чек получен.** Отправка изображения."
    
    # Undo
    undo_invalid_format = "❌ Неверный формат данных для удаления транзакции."
    undo_success = "✅ Транзакция от {date} {time} на сумму {amount} руб. успешно удалена."
    undo_error = "❌ {error}"
    
    # Промпты и Инструкции
    welcome = "Привет! Я бот для учета финансов."
    choose_type = "💰 **Новая транзакция**\n\nВыберите тип транзакции:"
    choose_category = "✅ Тип: **{type}**\n\nТеперь выберите категорию:"
    enter_amount = "✅ Категория: **{category}**\n\nВведите сумму транзакции (в формате 100.50 или 100):"
    enter_comment = "✅ Сумма: **{amount}** руб.\n\nВведите комментарий к транзакции (или нажмите /skip для пропуска):"
    
    # Кнопки
    btn_income = " доход 💰"
    btn_expense = " расход 🛒"
    btn_cancel = "❌ Отмена"
    btn_confirm = "✅ Подтвердить"
    btn_skip = "/skip"
    
MSG = Messages()
